Repository: Vitvitsky/tg-check-splitter
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Start greeting
ru: Привет! Я помогу разделить счёт.

source: Send photo to start
ru: Отправьте фото чека, чтобы начать.

source: Split check
ru: 📸 Разделить чек

source: My quota
ru: 📊 Мой лимит

source: Help
ru: ❓ Помощь

source: Help text
ru: Как это работает: 1. Отправьте фото чека — я распознаю позиции 2. Проверьте список и пригласите друзей по ссылке 3. Каждый отметит свои блюда 4. Выберите чаевые и получите персональные суммы

source: Session not found
ru: Сессия не найдена или вы уже участвуете.

source: Joined voting
ru: Вы присоединились к сессии! Выберите свои блюда.

source: Joined waiting
ru: Вы присоединились. Ожидайте начала голосования.

source: Preview results
ru: Предварительный расчёт: {text}

source: Free quota
ru: Бесплатно: {free_left}/{limit} в месяц

source: Paid scans
ru: Оплачено: {paid}

source: Reset date
ru: Сброс: {date}

source: You are participant
ru: Вы участник сессии. Ожидайте голосования.

source: Photo accepted
ru: Фото {n} принято. Отправьте ещё или нажмите:

source: Recognize
ru: 📸 Распознать

source: All correct
ru: ✅ Всё верно

source: Edit
ru: ✏️ Редактировать

source: Resend
ru: 🔄 Переотправить

source: Quota exhausted
ru: Бесплатный лимит исчерпан ({limit}/мес).

source: Pay stars
ru: Оплатить {stars} Stars

source: Recognizing
ru: ⏳ Распознаю чек...

source: OCR error
ru: ❌ Ошибка распознавания: {error} Попробуйте переотправить фото.

source: Recognized items
ru: 📋 Распознанные позиции:

source: Items total mismatch
ru: ⚠️ Сумма позиций ({items_sum}) не совпадает с итогом чека ({total})

source: Receipt total
ru: Итого по чеку: {total}

source: Send photo again
ru: Отправьте фото чека заново.

source: Editing items
ru: Редактирование позиций:

source: Add item
ru: ➕ Добавить позицию

source: Done
ru: ✅ Готово

source: Deleted
ru: Удалено

source: Edit item prompt
ru: Введите новое название и цену через дефис: Например: Пицца Маргарита - 700

source: Add item prompt
ru: Введите название и цену через дефис: Например: Тирамису - 380

source: Invalid format
ru: Неверный формат. Пример: Пицца Маргарита - 700

source: Item added
ru: ✅ Добавлено: {name} — {price}

source: Item updated
ru: ✅ Обновлено: {name} — {price}

source: Mark your dishes
ru: Отметьте свои блюда:

source: Back
ru: ← Назад

source: Next
ru: Далее →

source: Missing dish
ru: ⚠️ Не вижу своё блюдо

source: Item fully claimed
ru: Уже выбрали другие участники

source: Select tip percent
ru: Выберите процент чаевых:

source: Other percent
ru: Другой %

source: Reselect dishes
ru: ← Перевыбрать блюда

source: Enter tip number
ru: Введите процент чаевых (число):

source: Enter number example
ru: Введите число (например: 12).

source: Your dishes
ru: 🧾 Ваши блюда:

source: Dishes sum
ru: Сумма блюд: {amount}

source: Tip percent amount
ru: Чаевые {percent}%: {amount}

source: Grand total
ru: 💰 Итого: {amount}

source: Confirm
ru: ✅ Подтвердить

source: Change tip
ru: ✏️ Изменить чаевые

source: Confirmed
ru: Подтверждено!

source: Choice confirmed
ru: ✅ Ваш выбор подтверждён. Ожидайте итогов от админа.

source: Admin notified
ru: Админ получил уведомление.

source: Select one dish
ru: Выберите хотя бы одно блюдо!

source: Member confirmed
ru: ✅ {name} подтвердил(а) выбор ({count}/{total})

source: Member missing dish
ru: ⚠️ {name} не нашёл своё блюдо в списке!

source: Invite caption
ru: Ссылка для участников: {url} Покажите QR-код или отправьте ссылку участникам.

source: Waiting participants
ru: Ожидаю участников...

source: Current calculation
ru: 📊 Текущий расчёт

source: Finish
ru: ⏹ Завершить

source: Nobody voted
ru: Никто не отметил:

source: Reopen voting
ru: 🔄 Вернуть голосование

source: Split equal
ru: ➗ Разделить поровну

source: Remove from bill
ru: 🗑 Убрать из счёта

source: Session results
ru: Итоги сессии: {text}

source: All settled
ru: ✅ Все рассчитались

source: Voting continues
ru: Голосование продолжается.

source: Voting opened
ru: Голосование открыто.

source: Session closed
ru: Сессия закрыта! {text}

source: Session finished
ru: Сессия завершена! Твоя доля: {share} (чаевые {tip}%)

source: Invoice title
ru: Распознавание чека

source: Invoice description
ru: Оплата за OCR-распознавание одного чека

source: Scan label
ru: Сканирование чека

source: Payment success
ru: Оплата прошла! Нажмите кнопку, чтобы запустить распознавание.
